# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\GIT\A20_CANfestival\A20Bootload\A66_canfestival_bootload\Workspace01\A66_canfestival_bootload.cydsn\A66_canfestival_bootload.cyprj
# Date: Tue, 13 Sep 2016 06:41:03 GMT
#set_units -time ns
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]


# Component constraints for D:\GIT\A20_CANfestival\A20Bootload\A66_canfestival_bootload\Workspace01\A66_canfestival_bootload.cydsn\TopDesign\TopDesign.cysch
# Project: D:\GIT\A20_CANfestival\A20Bootload\A66_canfestival_bootload\Workspace01\A66_canfestival_bootload.cydsn\A66_canfestival_bootload.cyprj
# Date: Tue, 13 Sep 2016 06:40:58 GMT
