# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\PROJECT\A65\V6.0\A65_H6.0_FWP_V6.74_20160525\A65_6.0_Bootloader\A65_5.0_Bootloader\A65_3.2_Bootloader.cydsn\A65_3.2_Bootloader.cyprj
# Date: Tue, 19 Jul 2016 09:02:30 GMT
#set_units -time ns
create_clock -name {Clock_1(routed)} -period 200000000 -waveform {0 100000000} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 12800001 25600001} [list [get_pins {ClockBlock/dclk_glb_0}]]


# Component constraints for D:\PROJECT\A65\V6.0\A65_H6.0_FWP_V6.74_20160525\A65_6.0_Bootloader\A65_5.0_Bootloader\A65_3.2_Bootloader.cydsn\TopDesign\TopDesign.cysch
# Project: D:\PROJECT\A65\V6.0\A65_H6.0_FWP_V6.74_20160525\A65_6.0_Bootloader\A65_5.0_Bootloader\A65_3.2_Bootloader.cydsn\A65_3.2_Bootloader.cyprj
# Date: Tue, 19 Jul 2016 09:02:27 GMT
